# Markdown 基本语法

Markdown是一种轻量级标记语言

## Markdown简要规则

### 标题

在 Markdown 中，如果一段文字被定义为标题，只要在这段文字前加 # 号即可。
      # 一级标题
      ## 二级标题
      ### 三级标题
以此类推，总共六级标题，建议在井号后加一个空格，这是最标准的 Markdown 语法。

### 列表

熟悉 HTML 的同学肯定知道有序列表与无序列表的区别，在 Markdown 下，列表的显示只需要在文字前加上 - 或 * 即可变为无序列表，
有序列表则直接在文字前加 1. 2. 3. 符号要和文字之间加上一个字符的空格。
例如：
* 1
* 2
* 3

### 引用

如果你需要引用一小段别处的句子，那么就要用引用的格式。
> 例如这样
只需要在文本前加入 > 这种尖括号（大于号）即可

### 图片与链接

插入链接与插入图片的语法很像，区别在一个 !号
插入链接：[Baidu](http://www.baidu.com)
插入图片：![Mou icon](http://mouapp.com/128.png)

### 斜体与粗体

Markdown 的粗体和斜体也非常简单，用两个 * 包含一段文本就是粗体的语法，
用一个 * 包含一段文本就是斜体的语法

### 表格

例如下：
|第一列    |第二列    |第三列|
|----------|----------|------|
|11        |21        |31    |
|12        |22        |32    |

### 代码框

如果你是个程序猿，需要在文章里优雅的引用代码框，在 Markdown 下实现也非常简单，
只需要用两个 ` 把中间的代码包裹起来，如 `code`。

### 分割线

分割线的语法只需要另起一行，连续输入三个星号 *** 即可。
